-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Хост: 10.0.0.57
-- Время создания: Апр 06 2022 г., 14:25
-- Версия сервера: 5.7.35-38
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `f0497377_nari`
--

-- --------------------------------------------------------

--
-- Структура таблицы `vakants`
--

CREATE TABLE `vakants` (
  `id` int(11) NOT NULL,
  `id_factory` int(11) NOT NULL DEFAULT '0' COMMENT 'id фабрики',
  `text` text NOT NULL,
  `dolzhnostt` varchar(255) NOT NULL DEFAULT '0',
  `zarplata` varchar(255) NOT NULL DEFAULT '0',
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='вакакнсии';

--
-- Дамп данных таблицы `vakants`
--

INSERT INTO `vakants` (`id`, `id_factory`, `text`, `dolzhnostt`, `zarplata`, `date`) VALUES
(1, 2, '<p>Отдел управления персоналом  ТОО «Богатырь Комир» требуются: начальник участка по техническому обслуживанию и ремонту горно-транспортного  оборудования (Управление технологического транспорта)</p><p>Резюме принимаются: <br>г. Экибастуз, ул. Б. Момышулы 23 <br>Пост охраны, с 8-00 до 17-00<br> Электронная почта  -  odo@bogatyr.kz</p>', 'начальник участка по техническому обслуживанию и ремонту горно-транспортного  оборудования (Управление технологического транспорта)', '200 000KZT', '2022-03-17 11:15:04'),
(2, 2, '<p>Отдел управления персоналом  ТОО «Богатырь Комир» требуются:мастер по ремонту вагонов;</p><p>Резюме принимаются: <br>г. Экибастуз, ул. Б. Момышулы 23 <br>Пост охраны, с 8-00 до 17-00<br> Электронная почта  -  odo@bogatyr.kz</p>', 'мастер по ремонту вагонов;', '150 000KZT', '2022-03-17 11:15:42'),
(3, 2, '<p>Отдел управления персоналом  ТОО «Богатырь Комир» требуются: слесарь;</p><p>Резюме принимаются: <br>г. Экибастуз, ул. Б. Момышулы 23 <br>Пост охраны, с 8-00 до 17-00<br> Электронная почта  -  odo@bogatyr.kz</p>', 'слесарь', '260 000KZT', '2022-03-17 11:20:38'),
(4, 2, '<p>Отдел управления персоналом  ТОО «Богатырь Комир» требуются: токарь;</p><p>Резюме принимаются: <br>г. Экибастуз, ул. Б. Момышулы 23 <br>Пост охраны, с 8-00 до 17-00<br> Электронная почта  -  odo@bogatyr.kz</p>\r\n', 'токарь', '200 000KZT', '2022-03-17 11:21:37'),
(5, 1, '<p>АО \"КазМунайГаз - переработка и маркетинг\" объявляет открытый конкурс на замещение вакантных должностей.</p> <p>Отдел управления персоналом АО \"КазМунайГаз» требуются: начальник участка по техническому обслуживанию и ремонту горно-транспортного оборудования (Управление технологического транспорта);</p> <h3>Этапы отбора кандидатов</h3> <p>1 этап<br>Прием резюме кандидатов на сайте www.kmgrm.kz/vacancies</p> <p>2 этап<br>Отбор резюме кандидатов, соответствующих квалификационным требованиям. Комиссия имеет право запросить документы, подтверждающие достоверность сведений, указанных в резюме.</p> <p>3 этап <br>Прохождение кандидатами тестирования, соответствующими квалификационным требованиям. Место проведения: г. Астана.</p> <p>Тесты: <br> <ul> <li>- Профессиональные знания</li> <li>- Анализ вербальной информации</li> <li>- Анализ числовой информации</li> <li>- Знание языков</li> </ul> </p> <p>4 этап<br>Прохождение кандидатами собеседования с Конкурсной комиссией. На собеседование приглашаются кандидаты демонстрирующие результаты тестирования соответствующие и выше пороговых значений для вакантной должности. Место проведения: г. Астана.</p> <p>5 этап Оформление документов на прием кандидатов, успешно прошедших конкурсные процедуры. Кандидаты несут ответственность за подлинность достоверной информации в резюме.</p> ', 'начальник участка по техническому обслуживанию и ремонту горно-транспортного  оборудования (Управление технологического транспорта)', '200 000KZT', '2022-03-17 11:15:04'),
(6, 1, '<p>АО \"КазМунайГаз - переработка и маркетинг\" объявляет открытый конкурс на замещение вакантных должностей.</p> <p>Отдел управления персоналом АО \"КазМунайГаз» требуются: мастер по ремонту вагонов;</p> <h3>Этапы отбора кандидатов</h3> <p>1 этап<br>Прием резюме кандидатов на сайте www.kmgrm.kz/vacancies</p> <p>2 этап<br>Отбор резюме кандидатов, соответствующих квалификационным требованиям. Комиссия имеет право запросить документы, подтверждающие достоверность сведений, указанных в резюме.</p> <p>3 этап <br>Прохождение кандидатами тестирования, соответствующими квалификационным требованиям. Место проведения: г. Астана.</p> <p>Тесты: <br> <ul> <li>- Профессиональные знания</li> <li>- Анализ вербальной информации</li> <li>- Анализ числовой информации</li> <li>- Знание языков</li> </ul> </p> <p>4 этап<br>Прохождение кандидатами собеседования с Конкурсной комиссией. На собеседование приглашаются кандидаты демонстрирующие результаты тестирования соответствующие и выше пороговых значений для вакантной должности. Место проведения: г. Астана.</p> <p>5 этап Оформление документов на прием кандидатов, успешно прошедших конкурсные процедуры. Кандидаты несут ответственность за подлинность достоверной информации в резюме.</p> ', 'мастер по ремонту вагонов;', '150 000KZT', '2022-03-17 11:15:42'),
(7, 1, '<p>АО \"КазМунайГаз - переработка и маркетинг\" объявляет открытый конкурс на замещение вакантных должностей.</p> <p>Отдел управления персоналом АО \"КазМунайГаз» требуются: слесарь;</p> <h3>Этапы отбора кандидатов</h3> <p>1 этап<br>Прием резюме кандидатов на сайте www.kmgrm.kz/vacancies</p> <p>2 этап<br>Отбор резюме кандидатов, соответствующих квалификационным требованиям. Комиссия имеет право запросить документы, подтверждающие достоверность сведений, указанных в резюме.</p> <p>3 этап <br>Прохождение кандидатами тестирования, соответствующими квалификационным требованиям. Место проведения: г. Астана.</p> <p>Тесты: <br> <ul> <li>- Профессиональные знания</li> <li>- Анализ вербальной информации</li> <li>- Анализ числовой информации</li> <li>- Знание языков</li> </ul> </p> <p>4 этап<br>Прохождение кандидатами собеседования с Конкурсной комиссией. На собеседование приглашаются кандидаты демонстрирующие результаты тестирования соответствующие и выше пороговых значений для вакантной должности. Место проведения: г. Астана.</p> <p>5 этап Оформление документов на прием кандидатов, успешно прошедших конкурсные процедуры. Кандидаты несут ответственность за подлинность достоверной информации в резюме.</p> ', 'слесарь', '260 000KZT', '2022-03-17 11:20:38'),
(8, 1, '<p>АО \"КазМунайГаз - переработка и маркетинг\" объявляет открытый конкурс на замещение вакантных должностей.</p> <p>Отдел управления персоналом АО \"КазМунайГаз» требуются: токарь;</p> <h3>Этапы отбора кандидатов</h3> <p>1 этап<br>Прием резюме кандидатов на сайте www.kmgrm.kz/vacancies</p> <p>2 этап<br>Отбор резюме кандидатов, соответствующих квалификационным требованиям. Комиссия имеет право запросить документы, подтверждающие достоверность сведений, указанных в резюме.</p> <p>3 этап <br>Прохождение кандидатами тестирования, соответствующими квалификационным требованиям. Место проведения: г. Астана.</p> <p>Тесты: <br> <ul> <li>- Профессиональные знания</li> <li>- Анализ вербальной информации</li> <li>- Анализ числовой информации</li> <li>- Знание языков</li> </ul> </p> <p>4 этап<br>Прохождение кандидатами собеседования с Конкурсной комиссией. На собеседование приглашаются кандидаты демонстрирующие результаты тестирования соответствующие и выше пороговых значений для вакантной должности. Место проведения: г. Астана.</p> <p>5 этап Оформление документов на прием кандидатов, успешно прошедших конкурсные процедуры. Кандидаты несут ответственность за подлинность достоверной информации в резюме.</p> ', 'токарь', '200 000KZT', '2022-03-17 11:21:37'),
(9, 13, 'Описание вакансии Электрослесарь по обслуживанию АиСИ<br>\r\nЗарплата: 260 000KZT<br>\r\n<h2>ОБЯЗАННОСТИ:</h2>\r\nЭлектрослесарь по обслуживанию автоматики и систем измерении<br>\r\n<h2>Знание языков:</h2>\r\nКазахский - Начальный<br><br>\r\nГород: Аксу<br><br>\r\n\r\nТребуемый опыт работы: Нет опыта<br><br>\r\n\r\nТип занятости: Полная занятость<br><br>\r\n\r\nОбразование: Среднее образование<br><br>\r\n\r\nГрафик работы: Полный день<br><br>\r\nУ вакансии статус срочная<br><br>', 'Электрослесарь по обслуживанию АиСИ', '260 000KZT', '2022-03-18 03:55:39'),
(10, 12, 'Требуется: Электромонтер по ремонту аппаратуры релейной защиты и автоматики и современных аналогов<br><br>\r\n<b>Зарплата: </b>от 180 000 до 240 000 KZT до вычета налогов<br><br>\r\n<b>Аксу</b><br><br>\r\n<b>Требуемый опыт работы: </b>3–6 лет<br><br>\r\n<b>Обязанности:</b><br><br>\r\nРемонт и обслуживание электрооборудования до и выше 1000В<br><br>\r\n<b>Требования:</b><br><br>\r\nОбразование: Средне - техническое, специальность электрослесарь<br><br>\r\n<b>Условия:</b><br><br>\r\nВахта 14/14<br><br>\r\nПредприятие ТОО \"Комаровское горное предприятие\" г. Житикара<br><br>\r\n<b>Требования:</b><br><br>', 'Электромонтер по ремонту аппаратуры релейной защиты и автоматики и современных аналогов', 'от 180 000 до 240 000 KZT до вычета налогов', '2022-03-18 04:03:20'),
(11, 11, '<b>Описание вакансии </b>Машинист экскаватора<br><br>\r\n<b>Зарплата: </b>от 174000 - 188000 KZT<br><br>\r\n<b>Обязанности:</b><br><br>\r\nОбеспечение бесперебойной работы экскаватора;<br><br>\r\nБезопасное управление различными машинами;<br><br>\r\nЭксплуатация и ремонт машин и механизмов;<br><br>\r\nОсмотр механизмов, оборудования катка;<br><br>\r\nУправление автогрейдером при разработке, перемещении, планировке грунтов;<br><br>\r\nЗапуск и вывод автогрейдера на рабочий режим на объекте;<br><br>\r\nУправление экскаватором.<br><br>\r\n<b>Условия: </b>\r\nСоциальный пакет;<br><br>\r\nмедицинская страховка,<br><br>\r\nпремия по итогам года,<br><br>\r\nдополнительные дни к основному отпуску для сотрудников производственного блока,<br><br>\r\nльготные санаторно-курортные карты,<br><br>\r\nобучение,<br><br>\r\nвозможность участия в жилищных программах компании.<br><br>\r\n<b>Город: </b>Павлодар\r\n<br><br>\r\n<b>Требуемый опыт работы:</b> от 3 до 5 лет\r\n<br><br>\r\n<b>Тип занятости:</b> Полная занятость\r\n<br><br>\r\n<b>Образование:</b> Бакалавриат\r\n<br><br>\r\n<b>График работы:</b> Полный день<br><br>', 'Машинист экскаватора', 'от 174000 - 188000 KZT', '2022-03-18 04:50:42');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `vakants`
--
ALTER TABLE `vakants`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `vakants`
--
ALTER TABLE `vakants`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
